# 51 구구단

print('''
         Multtiplication Table
      1   2   3   4   5   6   7   8   9
---------------------------------------
1 |   1   2   3   4   5   6   7   8   9
2 |   2   2   3   4   5   6   7   8   9
3 |   3   2   3   4   5   6   7   8   9
4 |   4   2   3   4   5   6   7   8   9
5 |   5   2   3   4   5   6   7   8   9
6 |   6   2   3   4   5   6   7   8   9
7 |   7   2   3   4   5   6   7   8   9
8 |   8   2   3   4   5   6   7   8   9
9 |   9   2   3   4   5   6   7   8   9

''')

print('''
       Multtiplication Table
      1   2   3   4   5   6   7   8   9
---------------------------------------

''')
for i in range(1, 9+1): # 행
        print(f'{i} |   1   2   3   4   5   6   7   8   9')

print('''
       Multtiplication Table
      1   2   3   4   5   6   7   8   9
---------------------------------------
''')
for i in range(1, 9+1): # 행
    print(f'{i} |', end='')
    for j in range(1, 9+1):
      print(f'{i * j:4d}',end='' )
    print()





